import React from 'react';
import './StartStyle.scss';
import logo from '../../images/logo.png'
import img1 from '../../images/homePage_image1.png'
import img2 from '../../images/homePage_image2.png'
import img3 from '../../images/homePage_image3.png'
import img4 from '../../images/homePage_image4.png'
import img5 from '../../images/homePage_image5.png'
import img6 from '../../images/homePage_image6.png'
import img7 from '../../images/homePage_image7.png'

export const StartPage = () => {
  return (
    <div className='main_block'>  
      <div className="language">
        <p className='lang'><a href='/ua'>UA</a></p> <p className='lang'> | </p> <p className='lang'><a href='/eng'> ENG </a></p>
        <button className='button3'>Увійти </button>
      </div>
        <div className='col-12 col-md-6'>
          <img className='logo' src={logo}/>
          <div className='container1'>
            <p className='text1'>Фільми, серіали й інший контент <br></br>без обмежень</p>
            <p className='text2'>Дивіться будь-де. Скасувати підписку можна будь-коли.</p>
            <div className='container2'>
              <p className='text3'>Готові до перегляду? Введіть адресу електронної пошти,<br></br> щоб оформити або поновити підписку.</p>
            </div>
              <input type="email" className="email" id="exampleFormControlInput1" placeholder="Адреса елекронної пошти"/>
              <button className='button'>Почати </button>
          </div>
        </div>
        <div className='col-12 col-md-6'>
          <img className='img1' src={img1}/>
          <img className='img2' src={img2}/>
          <img className='img3' src={img3}/>
          <img className='img4' src={img4}/>
          <img className='img5' src={img5}/>
          <img className='img6' src={img6}/>
          <img className='img7' src={img7}/>
        </div>
      <div className='row'>
        <div className='col-12'>
          <div className='linear1'></div>
          <div className='linear2'></div>
          <div className='linear3'></div>
          <p className='text4'>Дивіться на телевізорі</p>
          <p className='text5'>Дивіться на Smart TV, Playstation, Xbox, Chromecast<br></br> Apple TV, Blu-ray-g програвачах тощо.</p>
          <p className='text6'>Завантажуйте контент і<br></br>дивіться його офлайн</p>
          <p className='text7'>Легко зберігайте улюблені телесеріали й фільми, <br></br>щоб дивитися їх будь-коли.</p>
          <p className='text8'>Дивіться будь-де</p>
          <p className='text9'>Дивіться фільми й телесеріали без обмежень на <br></br>смартфоні, планшеті, ноутбуці й телевізорі.</p>
          <p className='text10'>Створюйте профілі <br></br>для дітей</p>
          <p className='text11'>Ваші діти зможуть мандрувати країною фантазії <br></br>разом з улюбленими персонажами в спеціальних<br></br>профілях, які входять у вартість підписки.</p>
        </div>
      </div>
      <div className='line'></div>
      <div className='text12'>Поширені запитання</div>
      <ul>
        <li><p className='li_text'>Що таке Netflix?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Скільки коштує підписка Netflix?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Як скасувати підписку?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Де можна дивитись контент?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Що можна подивитись на Netflix?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Netflix підходить для дітей?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
        <li><p className='li_text'>Чому текст відображається цією мовою?</p><svg className="plus" width="32" height="34" viewBox="0 0 32 34" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.2857 18.7H17.7857V19.2V31.2C17.7857 31.7116 17.5919 32.1976 17.2542 32.5522C16.9172 32.9061 16.4655 33.1 16 33.1C15.5345 33.1 15.0828 32.9061 14.7458 32.5522C14.4081 32.1976 14.2143 31.7116 14.2143 31.2V19.2V18.7H13.7143H2.28571C1.8202 18.7 1.36852 18.5061 1.03154 18.1522C0.693772 17.7976 0.5 17.3116 0.5 16.8C0.5 16.2884 0.693771 15.8024 1.03154 15.4478C1.36852 15.0939 1.8202 14.9 2.28571 14.9H13.7143H14.2143V14.4V2.4C14.2143 1.88843 14.4081 1.40243 14.7458 1.04777C15.0828 0.693943 15.5345 0.5 16 0.5C16.4655 0.5 16.9172 0.693944 17.2542 1.04777C17.5919 1.40243 17.7857 1.88843 17.7857 2.4V14.4V14.9H18.2857H29.7143C30.1798 14.9 30.6315 15.0939 30.9685 15.4478C31.3062 15.8024 31.5 16.2884 31.5 16.8C31.5 17.3116 31.3062 17.7976 30.9685 18.1522C30.6315 18.5061 30.1798 18.7 29.7143 18.7H18.2857Z" fill="white" stroke="#49108B"/></svg></li>
      </ul>
      <p className='text13'>Готові до перегляду? Введіть адресу електронної пошти,<br></br> щоб оформити або поновити підписку.</p>
      <input type="email" className="email2" id="exampleFormControlInput1" placeholder="Адреса елекронної пошти"/>
      <button className='button2'>Почати </button>
    </div>
  );
}
