import { Col, Container, Form, Row } from 'react-bootstrap';
import './PaymentFormPageStyle.scss';

export const PaymentFormPage = () => {
  return (
    <Container className='paymentFormPage'>
      <div className="paymentFormText">
        <Form.Label className="text1">Оберіть план</Form.Label>
        <Form.Label className="text2">Оберіть комфортний Вам план.</Form.Label>
      </div>
      <div className="paymentFormPremium">
        <div className="cap"><Form.Label className="text-cap">Преміум</Form.Label></div>
        <Form.Label className="price">9.99</Form.Label>
        <svg className="price-svg" width="24" height="23" viewBox="0 0 24 23" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.0565 22.7954C13.5785 22.7954 11.3736 22.0919 9.44162 20.6849C7.50965 19.2779 6.14467 17.4615 5.34669 15.2355H0.936768V12.7156H4.7797C4.7167 12.2116 4.69066 11.7445 4.70158 11.3145C4.7125 10.8844 4.73854 10.5114 4.7797 10.1956H0.936768V7.67565H5.34669C6.14467 5.44969 7.50965 3.63322 9.44162 2.22625C11.3736 0.819271 13.5785 0.115784 16.0565 0.115784C17.5055 0.115784 18.8759 0.373239 20.1678 0.88815C21.4597 1.40306 22.6092 2.11159 23.6164 3.01373L21.8209 4.7777C21.0439 4.10571 20.1674 3.58072 19.1913 3.20273C18.2153 2.82473 17.1703 2.63574 16.0565 2.63574C14.2715 2.63574 12.6756 3.10319 11.2686 4.03809C9.86161 4.973 8.80113 6.18551 8.08714 7.67565H16.0565V10.1956H7.33115C7.24716 10.7626 7.21566 11.2615 7.23666 11.6925C7.25766 12.1234 7.28915 12.4644 7.33115 12.7156H16.0565V15.2355H8.08714C8.80113 16.7265 9.86161 17.9394 11.2686 18.8743C12.6756 19.8092 14.2715 20.2763 16.0565 20.2754C17.1695 20.2754 18.2144 20.0864 19.1913 19.7084C20.1682 19.3304 21.0448 18.8054 21.8209 18.1335L23.6164 19.8974C22.6084 20.8004 21.4584 21.5094 20.1665 22.0243C18.8746 22.5392 17.5046 22.7962 16.0565 22.7954Z" fill="white" /></svg>
        <Form.Label className='time'>за 1 місяць</Form.Label>
        <div className="line"></div>
        <Form.Label className='text1'>4K (Ultra HD) + HDR</Form.Label>
        <Form.Label className='text2'>Підтримувані пристрої:</Form.Label>
        <Form.Label className='text3'>Телевізор, комп’ютер, мобільний<br />телефон, планшет</Form.Label>
        <Form.Label className='text4'>Пристрої для завантаження: 4</Form.Label>
        <Form.Label className='text5'>Перегляд без реклами</Form.Label>
        <button className='select'>Обрати</button>
      </div>
      <div className="paymentFormStandart">
        <div className="cap"><Form.Label className="text-cap">Стандарт</Form.Label></div>
        <Form.Label className="price">7.49</Form.Label>
        <svg className="price-svg" width="24" height="23" viewBox="0 0 24 23" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.0565 22.7954C13.5785 22.7954 11.3736 22.0919 9.44162 20.6849C7.50965 19.2779 6.14467 17.4615 5.34669 15.2355H0.936768V12.7156H4.7797C4.7167 12.2116 4.69066 11.7445 4.70158 11.3145C4.7125 10.8844 4.73854 10.5114 4.7797 10.1956H0.936768V7.67565H5.34669C6.14467 5.44969 7.50965 3.63322 9.44162 2.22625C11.3736 0.819271 13.5785 0.115784 16.0565 0.115784C17.5055 0.115784 18.8759 0.373239 20.1678 0.88815C21.4597 1.40306 22.6092 2.11159 23.6164 3.01373L21.8209 4.7777C21.0439 4.10571 20.1674 3.58072 19.1913 3.20273C18.2153 2.82473 17.1703 2.63574 16.0565 2.63574C14.2715 2.63574 12.6756 3.10319 11.2686 4.03809C9.86161 4.973 8.80113 6.18551 8.08714 7.67565H16.0565V10.1956H7.33115C7.24716 10.7626 7.21566 11.2615 7.23666 11.6925C7.25766 12.1234 7.28915 12.4644 7.33115 12.7156H16.0565V15.2355H8.08714C8.80113 16.7265 9.86161 17.9394 11.2686 18.8743C12.6756 19.8092 14.2715 20.2763 16.0565 20.2754C17.1695 20.2754 18.2144 20.0864 19.1913 19.7084C20.1682 19.3304 21.0448 18.8054 21.8209 18.1335L23.6164 19.8974C22.6084 20.8004 21.4584 21.5094 20.1665 22.0243C18.8746 22.5392 17.5046 22.7962 16.0565 22.7954Z" fill="white" /></svg>
        <Form.Label className='time'>за 1 місяць</Form.Label>
        <div className="line"></div>
        <Form.Label className='text1'>1080p (Full HD)</Form.Label>
        <Form.Label className='text2'>Підтримувані пристрої:</Form.Label>
        <Form.Label className='text3'>Телевізор, комп’ютер, мобільний<br />телефон, планшет</Form.Label>
        <Form.Label className='text4'>Пристрої для завантаження: 2</Form.Label>
        <Form.Label className='text5'>Перегляд без реклами</Form.Label>
        <button className='select'>Обрати</button>
      </div>

      <div className="paymentFormBase">
        <div className="cap"><Form.Label className="text-cap">Базовий</Form.Label></div>
        <Form.Label className="price">4.99</Form.Label>
        <svg className="price-svg" width="24" height="23" viewBox="0 0 24 23" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16.0565 22.7954C13.5785 22.7954 11.3736 22.0919 9.44162 20.6849C7.50965 19.2779 6.14467 17.4615 5.34669 15.2355H0.936768V12.7156H4.7797C4.7167 12.2116 4.69066 11.7445 4.70158 11.3145C4.7125 10.8844 4.73854 10.5114 4.7797 10.1956H0.936768V7.67565H5.34669C6.14467 5.44969 7.50965 3.63322 9.44162 2.22625C11.3736 0.819271 13.5785 0.115784 16.0565 0.115784C17.5055 0.115784 18.8759 0.373239 20.1678 0.88815C21.4597 1.40306 22.6092 2.11159 23.6164 3.01373L21.8209 4.7777C21.0439 4.10571 20.1674 3.58072 19.1913 3.20273C18.2153 2.82473 17.1703 2.63574 16.0565 2.63574C14.2715 2.63574 12.6756 3.10319 11.2686 4.03809C9.86161 4.973 8.80113 6.18551 8.08714 7.67565H16.0565V10.1956H7.33115C7.24716 10.7626 7.21566 11.2615 7.23666 11.6925C7.25766 12.1234 7.28915 12.4644 7.33115 12.7156H16.0565V15.2355H8.08714C8.80113 16.7265 9.86161 17.9394 11.2686 18.8743C12.6756 19.8092 14.2715 20.2763 16.0565 20.2754C17.1695 20.2754 18.2144 20.0864 19.1913 19.7084C20.1682 19.3304 21.0448 18.8054 21.8209 18.1335L23.6164 19.8974C22.6084 20.8004 21.4584 21.5094 20.1665 22.0243C18.8746 22.5392 17.5046 22.7962 16.0565 22.7954Z" fill="white" /></svg>
        <Form.Label className='time'>за 1 місяць</Form.Label>
        <div className="line"></div>
        <Form.Label className='text1'>720p (Full HD)</Form.Label>
        <Form.Label className='text2'>Підтримувані пристрої:</Form.Label>
        <Form.Label className='text3'>Телевізор, комп’ютер, мобільний<br />телефон, планшет</Form.Label>
        <Form.Label className='text4'>Пристрої для завантаження: 4</Form.Label>
        <Form.Label className='text5'>Перегляд без реклами</Form.Label>
        <button className='select'>Обрати</button>
      </div>
      <Form.Label className='paymentForm-text-info'>Доступність контенту в якості HD (720p), Full HD (1080p), Ultra HD (4K) і HDR залежить від вашого інтернет-підключення та можливостей пристрою. Не весь контент доступний у всіх роздільних здатностях.Лише люди, які живуть із вами, можуть користуватися вашим обліковим записом. Дивіться одночасно на 4 пристроях із планом «Преміум», на 2 - із планом «Стандартний», на 1 - з планом «Базовий».</Form.Label>
    </Container>
  );
}
  